class Excel:
    def __init__(self):
        # Обозначаем нужные константы, переменные
        # обязательно обозначь константу self.path (путь к excel файлу)
        # чтобы в grab_data можно было уже открыть файл по этому пути и спарсить
        pass

    def grab_data(self):
        # Парсим данные с excel
        # Здесь понадобится библиотека xlrd
        pass

    def filter_data(self):
        # Фильтруем данные
        # Оставляем только нужные нам данные
        # (в телеге обсудим нужные данные)
        pass
